// backend/workers/workers.config.js
module.exports = [
  {
    name: 'check-system',
    module: './check-system',
    schedule: '*/1 * * * *',
    retry: { retryLimit: 3, retryDelay: 60000, retryBackoff: true }
  }
]


// '0 21 * * *'.   // 00:00 МСК
// '*/5 * * * *'   // каждые 5 минут
// '0 */4 * * *'   // каждые 4 часа
// '0 * * * *'     // каждые 0 минут каждого часа (00:00, 01:00, 02:00...)
// '15 * * * *'    // каждые 15 минут каждого часа (00:15, 01:15, 02:15...)
// '30 * * * *'    // каждые 30 минут каждого часа (00:30, 01:30, 02:30...)
// '15 */4 * * *'  // Каждые 4 часа в :15
// '30 */4 * * *'  // Каждые 4 часа в :30
// '15 1-23 * * *', // С 01:15 до 23:15
// '30 1-23 * * *', // С 01:30 до 23:30